public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
        // Задание 1
        int clientOs = 0;
        if (clientOs == 1) {
            System.out.println("Установите версию приложения для Android по ссылке");
        }
        if (clientOs == 0) {
            System.out.println("Установите версию приложения для iOS по ссылке");
        }
    }
}