public class Main {
    public static void main(String[] args) {
        // Задание 1
        int clientOs = 1;
        if (clientOs == 0) {
            System.out.println("Установите версию приложения для iOS по ссылке");
        } else {
            System.out.println("Установитте версию приложения для Android по ссыылке");
        }
    }
}